In [1]:
import pandas as pd

In [4]:
item = {'Shaurya': pd.Series([250, 15, 70, 100], index=['watch', 'toys', 'glasses', 'shirt']),
        'Ashish': pd.Series([120, 50, 90], index=['pants', 'books', 'toys' ])}

In [5]:
cart = pd.DataFrame(item)

In [6]:
cart

         Shaurya  Ashish
books        NaN    50.0
glasses     70.0     NaN
pants        NaN   120.0
shirt      100.0     NaN
toys        15.0    90.0
watch      250.0     NaN

In [7]:
cart.index

Index(['books', 'glasses', 'pants', 'shirt', 'toys', 'watch'], dtype='object')

In [8]:
cart.values

array([[ nan,  50.],
       [ 70.,  nan],
       [ nan, 120.],
       [100.,  nan],
       [ 15.,  90.],
       [250.,  nan]])

In [9]:
cart.columns

Index(['Shaurya', 'Ashish'], dtype='object')

In [10]:
cart.shape

(6, 2)

In [11]:
cart.ndim

2

In [12]:
cart.size

12

In [14]:
ashish_cart=pd.DataFrame(item, columns=['Ashish'])
ashish_cart

       Ashish
pants     120
books      50
toys       90

In [16]:
selected_item=pd.DataFrame(item, index=['pants','toys'])
selected_item

       Shaurya  Ashish
pants      NaN     120
toys      15.0      90

In [18]:
ashish_selected_item=pd.DataFrame(item, columns=['Ashish'],
                                  index=['pants','toys'])
ashish_selected_item

       Ashish
pants     120
toys       90